run/conjugateBatteryCC_Voltage/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    outsideSurface
    {
        type            patch;
        nFaces          9648;
        startFace       112424;
    }
    lithiumInterface
    {
        type            regionCouple;
        nFaces          1892;
        startFace       122072;
        shadowRegion    region0;
        shadowPatch     liquidToLithiumInterface;
        zone            lithiumInterfaceZone;
        attached        off;
        master          off;
        isWall          off;
        bridgeOverlap   off;
    }
    steelInterface
    {
        type            regionCouple;
        nFaces          6900;
        startFace       123964;
        shadowRegion    region0;
        shadowPatch     liquidToSteelInterface;
        zone            steelInterfaceZone;
        attached        off;
        master          off;
        isWall          off;
        bridgeOverlap   off;
    }
    topLithium
    {
        type            patch;
        nFaces          480;
        startFace       130864;
    }
    topSurface
    {
        type            patch;
        nFaces          544;
        startFace       131344;
    }
    outerAttachmentPoint
    {
        type            patch;
        nFaces          4;
        startFace       131888;
    }
    topAttachmentPoint
    {
        type            patch;
        nFaces          4;
        startFace       131892;
    }
)


// ************************************************************************* //
