run/conjugateBatteryCC_Voltage/system/splitPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      splitPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
patchToSplitName    outsideSurface;

newPatchName        outerAttachmentPoint;

x1  -0.003100;
y1  -0.003100;
z1  -0.005100;

x2  0.003100;
y2  0.003100;
z2  0.001100;

boundBoxes
(
    ($x1 $y1 $z1) ($x2 $y2 $z2)
);
// ************************************************************************* //
